% Ћокализовать корни уравнения f(x)=0,  где f(x)= x^3 - cos(x) + 1

% ¬ведЄм функцию f(x)
f = inline('x.^3 - cos(x) + 1');

% Ќарисуем еЄ график на отрезке [-10,10]
x = linspace(-10,10,100);
% ќси с градуировкой
figure('Name', '[-10,10]');
axes('NextPlot', 'Add');
grid on
plot(x, f(x));

% Ќарисуем еЄ график на отрезке [-1,1]
% ќси с градуировкой
figure('Name', '[-1,1]');
axes('NextPlot', 'Add');
grid on
x = linspace(-1,1,100);
plot(x, f(x));

% »з графика видно, что корни уравнения a находятся на отрезках [-0.6,-0.4] и [-0.2,0.2]

% Ќарисуем еЄ график на отрезке [-0.6,-0.4]
figure('Name', '[-0.6,-0.4]');
axes('NextPlot', 'Add');
grid on
x = linspace(-0.6,-0.4,100);
plot(x, f(x));

% Ќарисуем еЄ график на отрезке [-0.2,0.2]
figure('Name', '[-0.2,0.2]');
axes('NextPlot', 'Add');
grid on
x = linspace(-0.2,0.2,100);
plot(x, f(x));
